tinko26/ao/src/ao_sys_xc32_pic32_can/ao_can_2.h
// ----------------------------------------------------------------------------

// MIT License

// Copyright (c) 2022 Stefan Wagner

// Permission is hereby granted, free of charge, to any person obtaining a
// copy of this software and associated documentation files (the "Software"),
// to deal in the Software without restriction, including without limitation
// the rights to use, copy, modify, merge, publish, distribute, sublicense,
// and/or sell copies of the Software, and to permit persons to whom the
// Software is furnished to do so, subject to the following conditions:

// The above copyright notice and this permission notice shall be included in
// all copies or substantial portions of the Software.

// THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
// IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
// FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
// AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
// LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING
// FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER
// DEALINGS IN THE SOFTWARE.

// ----------------------------------------------------------------------------

// CAN 2.

// ----------------------------------------------------------------------------

#include <ao_can.h>
#include <ao_recv_obj.h>
#include <ao_send_obj.h>
#include <ao_task.h>
#include <stdbool.h>
#include <xc.h>

// ----------------------------------------------------------------------------

#ifndef AO_CAN_2

#ifdef  _CAN2

#define AO_CAN_2                        (true)

#else

#define AO_CAN_2                        (false)

#endif

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_BAUD_2

#define AO_CAN_BAUD_2                   (100000)

#endif

#ifndef AO_CAN_BAUD_SAMPLE_2

#define AO_CAN_BAUD_SAMPLE_2            (85)

#endif

#ifndef AO_CAN_BAUD_SAMPLE_THRICE_2

#define AO_CAN_BAUD_SAMPLE_THRICE_2     (true)

#endif

#ifndef AO_CAN_BAUD_SJW_2

#define AO_CAN_BAUD_SJW_2               (1)

#endif

#ifndef AO_CAN_BAUD_WAKE_UP_FILTER_2

#define AO_CAN_BAUD_WAKE_UP_FILTER_2    (false)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_BAUD_MAX_2

#define AO_CAN_BAUD_MAX_2               ao_can_baud_max(AO_SYS_CLOCK_CAN2)

#endif

#ifndef AO_CAN_BAUD_MIN_2

#define AO_CAN_BAUD_MIN_2               ao_can_baud_min(AO_SYS_CLOCK_CAN2)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_BUFFERS_2_0

#define AO_CAN_BUFFERS_2_0              (0)

#endif

#ifndef AO_CAN_BUFFERS_2_1

#define AO_CAN_BUFFERS_2_1              (0)

#endif

#ifndef AO_CAN_BUFFERS_2_2

#define AO_CAN_BUFFERS_2_2              (0)

#endif

#ifndef AO_CAN_BUFFERS_2_3

#define AO_CAN_BUFFERS_2_3              (0)

#endif

#ifndef AO_CAN_BUFFERS_2_4

#define AO_CAN_BUFFERS_2_4              (0)

#endif

#ifndef AO_CAN_BUFFERS_2_5

#define AO_CAN_BUFFERS_2_5              (0)

#endif

#ifndef AO_CAN_BUFFERS_2_6

#define AO_CAN_BUFFERS_2_6              (0)

#endif

#ifndef AO_CAN_BUFFERS_2_7

#define AO_CAN_BUFFERS_2_7              (0)

#endif

#ifndef AO_CAN_BUFFERS_2_8

#define AO_CAN_BUFFERS_2_8              (0)

#endif

#ifndef AO_CAN_BUFFERS_2_9

#define AO_CAN_BUFFERS_2_9              (0)

#endif

#ifndef AO_CAN_BUFFERS_2_10

#define AO_CAN_BUFFERS_2_10             (0)

#endif

#ifndef AO_CAN_BUFFERS_2_11

#define AO_CAN_BUFFERS_2_11             (0)

#endif

#ifndef AO_CAN_BUFFERS_2_12

#define AO_CAN_BUFFERS_2_12             (0)

#endif

#ifndef AO_CAN_BUFFERS_2_13

#define AO_CAN_BUFFERS_2_13             (0)

#endif

#ifndef AO_CAN_BUFFERS_2_14

#define AO_CAN_BUFFERS_2_14             (0)

#endif

#ifndef AO_CAN_BUFFERS_2_15

#define AO_CAN_BUFFERS_2_15             (0)

#endif

#ifndef AO_CAN_BUFFERS_2_16

#define AO_CAN_BUFFERS_2_16             (0)

#endif

#ifndef AO_CAN_BUFFERS_2_17

#define AO_CAN_BUFFERS_2_17             (0)

#endif

#ifndef AO_CAN_BUFFERS_2_18

#define AO_CAN_BUFFERS_2_18             (0)

#endif

#ifndef AO_CAN_BUFFERS_2_19

#define AO_CAN_BUFFERS_2_19             (0)

#endif

#ifndef AO_CAN_BUFFERS_2_20

#define AO_CAN_BUFFERS_2_20             (0)

#endif

#ifndef AO_CAN_BUFFERS_2_21

#define AO_CAN_BUFFERS_2_21             (0)

#endif

#ifndef AO_CAN_BUFFERS_2_22

#define AO_CAN_BUFFERS_2_22             (0)

#endif

#ifndef AO_CAN_BUFFERS_2_23

#define AO_CAN_BUFFERS_2_23             (0)

#endif

#ifndef AO_CAN_BUFFERS_2_24

#define AO_CAN_BUFFERS_2_24             (0)

#endif

#ifndef AO_CAN_BUFFERS_2_25

#define AO_CAN_BUFFERS_2_25             (0)

#endif

#ifndef AO_CAN_BUFFERS_2_26

#define AO_CAN_BUFFERS_2_26             (0)

#endif

#ifndef AO_CAN_BUFFERS_2_27

#define AO_CAN_BUFFERS_2_27             (0)

#endif

#ifndef AO_CAN_BUFFERS_2_28

#define AO_CAN_BUFFERS_2_28             (0)

#endif

#ifndef AO_CAN_BUFFERS_2_29

#define AO_CAN_BUFFERS_2_29             (0)

#endif

#ifndef AO_CAN_BUFFERS_2_30

#define AO_CAN_BUFFERS_2_30             (0)

#endif

#ifndef AO_CAN_BUFFERS_2_31

#define AO_CAN_BUFFERS_2_31             (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_BUFFERS_2

#define AO_CAN_BUFFERS_2                                                    \
(                                                                           \
        AO_CAN_BUFFERS_2_0  +                                               \
        AO_CAN_BUFFERS_2_1  +                                               \
        AO_CAN_BUFFERS_2_2  +                                               \
        AO_CAN_BUFFERS_2_3  +                                               \
        AO_CAN_BUFFERS_2_4  +                                               \
        AO_CAN_BUFFERS_2_5  +                                               \
        AO_CAN_BUFFERS_2_6  +                                               \
        AO_CAN_BUFFERS_2_7  +                                               \
        AO_CAN_BUFFERS_2_8  +                                               \
        AO_CAN_BUFFERS_2_9  +                                               \
        AO_CAN_BUFFERS_2_10 +                                               \
        AO_CAN_BUFFERS_2_11 +                                               \
        AO_CAN_BUFFERS_2_12 +                                               \
        AO_CAN_BUFFERS_2_13 +                                               \
        AO_CAN_BUFFERS_2_14 +                                               \
        AO_CAN_BUFFERS_2_15 +                                               \
        AO_CAN_BUFFERS_2_16 +                                               \
        AO_CAN_BUFFERS_2_17 +                                               \
        AO_CAN_BUFFERS_2_18 +                                               \
        AO_CAN_BUFFERS_2_19 +                                               \
        AO_CAN_BUFFERS_2_20 +                                               \
        AO_CAN_BUFFERS_2_21 +                                               \
        AO_CAN_BUFFERS_2_22 +                                               \
        AO_CAN_BUFFERS_2_23 +                                               \
        AO_CAN_BUFFERS_2_24 +                                               \
        AO_CAN_BUFFERS_2_25 +                                               \
        AO_CAN_BUFFERS_2_26 +                                               \
        AO_CAN_BUFFERS_2_27 +                                               \
        AO_CAN_BUFFERS_2_28 +                                               \
        AO_CAN_BUFFERS_2_29 +                                               \
        AO_CAN_BUFFERS_2_30 +                                               \
        AO_CAN_BUFFERS_2_31                                                 \
)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_BUS_2

