tinko26/ao/src/ao_sys_xc32_pic32_can/ao_can_2.h
#define AO_CAN_BUS_2                    (false)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FIFOS_RX_2

#define AO_CAN_FIFOS_RX_2               (0)

#endif

#ifndef AO_CAN_FIFOS_TX_2

#define AO_CAN_FIFOS_TX_2               (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FIFOS_2

#define AO_CAN_FIFOS_2                  ((AO_CAN_FIFOS_RX_2) + (AO_CAN_FIFOS_TX_2))

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_2_0

#define AO_CAN_FILTER_EID_2_0           (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_2_0

#define AO_CAN_FILTER_ENABLE_2_0        (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_2_0

#define AO_CAN_FILTER_FIFO_2_0          (0)

#endif

#ifndef AO_CAN_FILTER_IDE_2_0

#define AO_CAN_FILTER_IDE_2_0           (0)

#endif

#ifndef AO_CAN_FILTER_MASK_2_0

#define AO_CAN_FILTER_MASK_2_0          (0)

#endif

#ifndef AO_CAN_FILTER_SID_2_0

#define AO_CAN_FILTER_SID_2_0           (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_2_1

#define AO_CAN_FILTER_EID_2_1           (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_2_1

#define AO_CAN_FILTER_ENABLE_2_1        (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_2_1

#define AO_CAN_FILTER_FIFO_2_1          (0)

#endif

#ifndef AO_CAN_FILTER_IDE_2_1

#define AO_CAN_FILTER_IDE_2_1           (0)

#endif

#ifndef AO_CAN_FILTER_MASK_2_1

#define AO_CAN_FILTER_MASK_2_1          (0)

#endif

#ifndef AO_CAN_FILTER_SID_2_1

#define AO_CAN_FILTER_SID_2_1           (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_2_2

#define AO_CAN_FILTER_EID_2_2           (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_2_2

#define AO_CAN_FILTER_ENABLE_2_2        (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_2_2

#define AO_CAN_FILTER_FIFO_2_2          (0)

#endif

#ifndef AO_CAN_FILTER_IDE_2_2

#define AO_CAN_FILTER_IDE_2_2           (0)

#endif

#ifndef AO_CAN_FILTER_MASK_2_2

#define AO_CAN_FILTER_MASK_2_2          (0)

#endif

#ifndef AO_CAN_FILTER_SID_2_2

#define AO_CAN_FILTER_SID_2_2           (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_2_3

#define AO_CAN_FILTER_EID_2_3           (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_2_3

#define AO_CAN_FILTER_ENABLE_2_3        (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_2_3

#define AO_CAN_FILTER_FIFO_2_3          (0)

#endif

#ifndef AO_CAN_FILTER_IDE_2_3

#define AO_CAN_FILTER_IDE_2_3           (0)

#endif

#ifndef AO_CAN_FILTER_MASK_2_3

#define AO_CAN_FILTER_MASK_2_3          (0)

#endif

#ifndef AO_CAN_FILTER_SID_2_3

#define AO_CAN_FILTER_SID_2_3           (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_2_4

#define AO_CAN_FILTER_EID_2_4           (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_2_4

#define AO_CAN_FILTER_ENABLE_2_4        (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_2_4

#define AO_CAN_FILTER_FIFO_2_4          (0)

#endif

#ifndef AO_CAN_FILTER_IDE_2_4

#define AO_CAN_FILTER_IDE_2_4           (0)

#endif

#ifndef AO_CAN_FILTER_MASK_2_4

#define AO_CAN_FILTER_MASK_2_4          (0)

#endif

#ifndef AO_CAN_FILTER_SID_2_4

#define AO_CAN_FILTER_SID_2_4           (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_2_5

#define AO_CAN_FILTER_EID_2_5           (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_2_5

#define AO_CAN_FILTER_ENABLE_2_5        (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_2_5

#define AO_CAN_FILTER_FIFO_2_5          (0)

#endif

#ifndef AO_CAN_FILTER_IDE_2_5

#define AO_CAN_FILTER_IDE_2_5           (0)

#endif

#ifndef AO_CAN_FILTER_MASK_2_5

#define AO_CAN_FILTER_MASK_2_5          (0)

#endif

#ifndef AO_CAN_FILTER_SID_2_5

#define AO_CAN_FILTER_SID_2_5           (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_2_6

#define AO_CAN_FILTER_EID_2_6           (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_2_6

#define AO_CAN_FILTER_ENABLE_2_6        (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_2_6

#define AO_CAN_FILTER_FIFO_2_6          (0)

#endif

#ifndef AO_CAN_FILTER_IDE_2_6

#define AO_CAN_FILTER_IDE_2_6           (0)

#endif

#ifndef AO_CAN_FILTER_MASK_2_6

#define AO_CAN_FILTER_MASK_2_6          (0)

#endif

#ifndef AO_CAN_FILTER_SID_2_6

#define AO_CAN_FILTER_SID_2_6           (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_2_7

#define AO_CAN_FILTER_EID_2_7           (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_2_7

#define AO_CAN_FILTER_ENABLE_2_7        (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_2_7

#define AO_CAN_FILTER_FIFO_2_7          (0)

#endif

#ifndef AO_CAN_FILTER_IDE_2_7

#define AO_CAN_FILTER_IDE_2_7           (0)

#endif

#ifndef AO_CAN_FILTER_MASK_2_7

#define AO_CAN_FILTER_MASK_2_7          (0)

#endif

#ifndef AO_CAN_FILTER_SID_2_7

#define AO_CAN_FILTER_SID_2_7           (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_2_8

#define AO_CAN_FILTER_EID_2_8           (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_2_8

#define AO_CAN_FILTER_ENABLE_2_8        (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_2_8

#define AO_CAN_FILTER_FIFO_2_8          (0)

#endif

#ifndef AO_CAN_FILTER_IDE_2_8

#define AO_CAN_FILTER_IDE_2_8           (0)

#endif

#ifndef AO_CAN_FILTER_MASK_2_8

#define AO_CAN_FILTER_MASK_2_8          (0)

#endif

#ifndef AO_CAN_FILTER_SID_2_8

#define AO_CAN_FILTER_SID_2_8           (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_2_9

#define AO_CAN_FILTER_EID_2_9           (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_2_9

#define AO_CAN_FILTER_ENABLE_2_9        (false)

#endif

