tinko26/ao/src/ao_sys_xc32_pic32_can/ao_can_2.h
#define AO_CAN_FILTER_MASK_2_29         (0)

#endif

#ifndef AO_CAN_FILTER_SID_2_29

#define AO_CAN_FILTER_SID_2_29          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_2_30

#define AO_CAN_FILTER_EID_2_30          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_2_30

#define AO_CAN_FILTER_ENABLE_2_30       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_2_30

#define AO_CAN_FILTER_FIFO_2_30         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_2_30

#define AO_CAN_FILTER_IDE_2_30          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_2_30

#define AO_CAN_FILTER_MASK_2_30         (0)

#endif

#ifndef AO_CAN_FILTER_SID_2_30

#define AO_CAN_FILTER_SID_2_30          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_2_31

#define AO_CAN_FILTER_EID_2_31          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_2_31

#define AO_CAN_FILTER_ENABLE_2_31       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_2_31

#define AO_CAN_FILTER_FIFO_2_31         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_2_31

#define AO_CAN_FILTER_IDE_2_31          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_2_31

#define AO_CAN_FILTER_MASK_2_31         (0)

#endif

#ifndef AO_CAN_FILTER_SID_2_31

#define AO_CAN_FILTER_SID_2_31          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_MASK_EID_2_0

#define AO_CAN_FILTER_MASK_EID_2_0      (0)

#endif

#ifndef AO_CAN_FILTER_MASK_IDE_2_0

#define AO_CAN_FILTER_MASK_IDE_2_0      (0)

#endif

#ifndef AO_CAN_FILTER_MASK_SID_2_0

#define AO_CAN_FILTER_MASK_SID_2_0      (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_MASK_EID_2_1

#define AO_CAN_FILTER_MASK_EID_2_1      (0)

#endif

#ifndef AO_CAN_FILTER_MASK_IDE_2_1

#define AO_CAN_FILTER_MASK_IDE_2_1      (0)

#endif

#ifndef AO_CAN_FILTER_MASK_SID_2_1

#define AO_CAN_FILTER_MASK_SID_2_1      (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_MASK_EID_2_2

#define AO_CAN_FILTER_MASK_EID_2_2      (0)

#endif

#ifndef AO_CAN_FILTER_MASK_IDE_2_2

#define AO_CAN_FILTER_MASK_IDE_2_2      (0)

#endif

#ifndef AO_CAN_FILTER_MASK_SID_2_2

#define AO_CAN_FILTER_MASK_SID_2_2      (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_MASK_EID_2_3

#define AO_CAN_FILTER_MASK_EID_2_3      (0)

#endif

#ifndef AO_CAN_FILTER_MASK_IDE_2_3

#define AO_CAN_FILTER_MASK_IDE_2_3      (0)

#endif

#ifndef AO_CAN_FILTER_MASK_SID_2_3

#define AO_CAN_FILTER_MASK_SID_2_3      (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_INVALID_2

#define AO_CAN_INVALID_2                (false)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_MODE_2

#define AO_CAN_MODE_2                   (false)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_OVERFLOW_2

#define AO_CAN_OVERFLOW_2               (false)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_RX_2

#define AO_CAN_RX_2                     ((AO_CAN_FIFOS_RX_2) > 0 ? true : false)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_SENT_2

#define AO_CAN_SENT_2                   (false)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_SYSTEM_2

#define AO_CAN_SYSTEM_2                 (false)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_TIMER_2

#define AO_CAN_TIMER_2                  (false)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_TX_2

#define AO_CAN_TX_2                     ((AO_CAN_FIFOS_TX_2) > 0 ? true : false)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_UNDERFLOW_2

#define AO_CAN_UNDERFLOW_2              (false)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_WAKE_UP_2

#define AO_CAN_WAKE_UP_2                (false)

#endif

// ----------------------------------------------------------------------------

extern  ao_can_t                        ao_can_buffers_2[AO_CAN_BUFFERS_2];

extern  ao_send_obj_t                   ao_can_in_2     [AO_CAN_FIFOS_RX_2];

extern  ao_recv_obj_t                   ao_can_out_2    [AO_CAN_FIFOS_TX_2];

extern  ao_task_t                       ao_can_task_2;

// ----------------------------------------------------------------------------

// This event is raised, when there is an error on the CAN bus.

// This event is raised every time there is a change in the current error state
// of the CAN module with respect to the CAN network.

// The error states are tracked by the CxTREC register.

// ----------------------------------------------------------------------------

void    ao_can_bus_2(                   ao_can_bus_info_t const * info);

// ----------------------------------------------------------------------------

void    ao_can_config_2();

void    ao_can_config_baud_2();

void    ao_can_config_fifos_2();

void    ao_can_config_filter_masks_2();

void    ao_can_config_filters_2();

// ----------------------------------------------------------------------------

// This event occurs, when there was an error in the last received message or
// transmitted message.

// However, the specific error is not available to the user application.

// ----------------------------------------------------------------------------

void    ao_can_invalid_2(               ao_can_invalid_info_t const * info);

// ----------------------------------------------------------------------------

void    ao_can_listen_all_2();

// ----------------------------------------------------------------------------

